{
	"use": [
		{
			"type": "h1",
			"content": "<center>Terms of Use</center>"
		},
		{
			"type": "p",
			"content": "Welcome to our website and use the services we offer. Please read the following terms of use carefully before using this website. By accessing this website and using our services, you agree to be bound by the following terms and conditions:"
		},
		{
			"id": "popuptext",
			"type": "div",
			"content": ""
		},
		{
			"type": "h3",
			"content": "1. Use of Services"
		},
		{
			"type": "p",
			"content": "You agree to use our Services only for lawful purposes and to comply with all applicable laws and regulations. You may not use our Services to engage in any illegal activity or act that violates the rights of others."
		},
		{
			"type": "h3",
			"content": "2. Account Registration"
		},
		{
			"type": "p",
			"content": "In some cases, you may be required to register for an account to use certain of our services. You are responsible for the accuracy and confidentiality of your account information and undertake not to disclose your account information to any third party."
		},
		{
			"type": "h3",
			"content": "3. intellectual property"
		},
		{
			"type": "p",
			"content": "This website and its contents (including but not limited to text, pictures, logos, software, etc.) are protected by intellectual property laws. You may not copy, modify, transmit or exploit the content in any way without authorization."
		},
		{
			"type": "h3",
			"content": "4. Disclaimer of Warranties"
		},
		{
			"type": "p",
			"content": "We do our best to ensure that the information provided on the website is accurate and complete. However, we make no warranties, express or implied, as to the accuracy, suitability or completeness of the information. Your use of the information on this website is at your own risk."
		},
		{
			"type": "h3",
			"content": "5. Privacy Protection"
		},
		{
			"type": "p",
			"content": "We respect and protect the privacy of our users. We will collect, use and protect your personal information in accordance with our Privacy Policy. Please read our Privacy Policy carefully before using this website."
		},
		{
			"type": "h3",
			"content": "6. Third-Party Links"
		},
		{
			"type": "p",
			"content": "This website may contain links to third-party websites. These links are provided for convenience only and we are not responsible for the content and privacy policies of these websites. Access to these links is at your own risk."
		},
		{
			"type": "h3",
			"content": "7. Modification of Terms"
		},
		{
			"type": "p",
			"content": "We reserve the right to change or update the Terms of Use at any time. The updated terms will be posted on this website. Your continued use of the Site will be deemed acceptance of the modified Terms."
		},
		{
			"type": "/div",
			"content": ""
		},
		{
			"type": "h3",
			"content": "If you have any questions or comments about the Terms of Use, please contact us using our contact details. Thank you for complying with our Terms of Use!"
		}
	],
	"privacy": [
		{
			"type": "h1",
			"content": "<center>Privacy Policy</center>"
		},
		{
			"type": "p",
			"content": "Thank you for visiting our website and reviewing our Privacy Policy. We take your privacy very seriously and are committed to keeping your personal information secure. Please read the following Privacy Policy carefully before using our website to understand how we collect, use and protect your personal information."
		},
		{
			"id": "popuptext",
			"type": "div",
			"content": ""
		},
		{
			"type": "h3",
			"content": "1. Information Collection"
		},
		{
			"type": "p",
			"content": "When you visit our website, we may collect your personal information, including but not limited to your name, email address, contact details, etc. We may also automatically collect information about your access to and use of the website, such as IP address, browser type, access times, etc."
		},
		{
			"type": "h3",
			"content": "2. Use of Information"
		},
		{
			"type": "p",
			"content": "The personal information we collect will be used for the following purposes:"
		},
		{
			"type": "p",
			"content": "- to provide the services and information you have requested;"
		},
		{
			"type": "p",
			"content": "- to improve the content and functionality of the website;"
		},
		{
			"type": "p",
			"content": "- to send you notices and updates related to the Site;"
		},
		{
			"type": "p",
			"content": "- analyze website traffic and user behavior."
		},
		{
			"type": "h3",
			"content": "3. Information Protection"
		},
		{
			"type": "p",
			"content": "We are committed to taking reasonable security measures to protect your personal information from unauthorized access, use or disclosure. We will do our best to keep your information secure."
		},
		{
			"type": "h3",
			"content": "4. Information Sharing"
		},
		{
			"type": "p",
			"content": "We will not disclose your personal information to any third party unless we have your consent or are required by law. In some cases, we may share information necessary with our partners in order to provide you with a better service."
		},
		{
			"type": "h3",
			"content": "5. Cookie"
		},
		{
			"type": "p",
			"content": "We may place cookies or similar technologies on your computer in order to recognize your browser and preferences. This information will help us improve the user experience and functionality of our website."
		},
		{
			"type": "h3",
			"content": "6. Third-Party Links"
		},
		{
			"type": "p",
			"content": "Our website may contain links to third-party websites. Please be aware that we are not responsible for the privacy policies and practices of these websites. We encourage you to review their privacy policies when you visit these links."
		},
		{
			"type": "h3",
			"content": "7. Minors' Privacy"
		},
		{
			"type": "p",
			"content": "Our website is not directed to minors under the age of 18. If you are a minor, please be accompanied by a guardian to use our website."
		},
		{
			"type": "h3",
			"content": "8. Privacy Policy Updates"
		},
		{
			"type": "p",
			"content": "We reserve the right to change or update the Privacy Policy at any time. We will post the updated policy on our website and we encourage you to check back regularly for the latest information."
		},
		{
			"type": "/div",
			"content": ""
		},
		{
			"type": "h3",
			"content": "If you have any questions or concerns about the Privacy Policy, please feel free to contact us through our contact details. Thank you for your interest and support of our Privacy Policy!"
		}
	],
	"trademark": [
		{
			"type": "h1",
			"content": "<center>Trademark<center>"
		},
		{
			"type": "p",
			"content": "We take the protection of intellectual property rights, including trademark rights, very seriously. The following is our Trademark Policy to clarify our position on trademarks and related matters.<br>"
		},
		{
			"id": "popuptext",
			"type": "div",
			"content": ""
		},
		{
			"type": "h3",
			"content": "1. Trademark Ownership"
		},
		{
			"type": "p",
			"content": "All trademarks and logos (hereinafter referred to as \"Trademarks\") used by us on this website are the property of our company or our affiliates. These trademarks are protected by intellectual property laws."
		},
		{
			"type": "h3",
			"content": "2. Use of Trademarks"
		},
		{
			"type": "p",
			"content": "No one may use, copy or modify our trademarks in any way without our prior written permission. This includes, but is not limited to, commercial use of trademarks, advertising, domain name registration, etc."
		},
		{
			"type": "h3",
			"content": "3. License to Use"
		},
		{
			"type": "p",
			"content": "If you wish to use our trademarks, please contact us in advance and obtain our express written authorization. Unauthorized use of our trademarks may constitute infringement and we reserve the right to pursue legal liability."
		},
		{
			"type": "h3",
			"content": "4. Trademark Protection"
		},
		{
			"type": "p",
			"content": "We will actively defend our trademark rights, including but not limited to monitoring infringements, taking legal action, etc. If you become aware of any unauthorized use of our trademarks, please notify us immediately."
		},
		{
			"type": "h3",
			"content": "5. Third-Party Trademarks"
		},
		{
			"type": "p",
			"content": "Trademarks of other companies may appear on this website. These trademarks are used for identification purposes only and do not imply that we are in any way affiliated with these companies. For the use of third-party trademarks, please contact the respective company directly."
		},
		{
			"type": "h3",
			"content": "6. Trademark Policy Update"
		},
		{
			"type": "p",
			"content": "We reserve the right to change or update our trademark policy at any time. The updated policy will be posted on the website. You can check back regularly for the latest information."
		},
		{
			"type": "/div",
			"content": ""
		},
		{
			"type": "h3",
			"content": "If you have any questions or comments about the Trademark Policy, please contact us using our contact details. Thank you for complying with our trademark policy!"
		}
	],
	"about": [
		{
			"type": "h1",
			"content": "<center>About</center>"
		},
		{
			"id": "popuptext",
			"type": "div",
			"content": ""
		},
		{
			"type": "h2",
			"content": "Divide the work"
		},
		{
			"type": "h3",
			"content": "&nbsp;&nbsp;&nbsp;Koizumi:"
		},
		{
			"type": "p",
			"content": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--Homepage"
		},
		{
			"type": "p",
			"content": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--Front end development"
		},
		{
			"type": "p",
			"content": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--Backend management"
		},
		{
			"type": "p",
			"content": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--User System"
		},
		{
			"type": "p",
			"content": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--Database construction"
		},
		{
			"type": "p",
			"content": "Contact way:koizumi.369c@outlook.com"
		},
		{
			"type": "br",
			"content": ""
		},
		{
			"type": "h3",
			"content": "&nbsp;&nbsp;&nbsp;璟:"
		},
		{
			"type": "p",
			"content": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--Secondary page"
		},
		{
			"type": "p",
			"content": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--Resources"
		},
		{
			"type": "br",
			"content": ""
		},
		{
			"type": "h2",
			"content": "Project Information"
		},
		{
			"type": "h3",
			"content": "Project Repositories =><a href=\"https://github.com/mukekka/KonoProject\">Github</a>"
		},
		{
			"type": "h3",
			"content": "For detailed information, please refer to project Github README.md"
		},
		{
			"type": "hr",
			"content": ""
		},
		{
			"type": "h3",
			"content": "Privacy policy, trademark policy, and terms of use are for reference only. The terms are provided by CharGPT3.5."
		},
		{
			"type": "h3",
			"content": "The trademark 'Marcohard' on this website refers to 'Microsoft'"
		},
		{
			"type": "/div",
			"content": ""
		}
	],
	"other": [
		{
			"type": "button",
			"content": "OK"
		}
	]
}